// ПРОСТЫЕ ЗАДАЧИ

// Solution:

// Задачи на цикл FOR

// Задача 1: Вывод чисел от 1 до 10
// Описание: Напишите цикл for, который выводит числа от 1 до 10.

// Solution:

// for (let i = 1; i < 11; i++) {
//   console.log(i);
// }


// Задача 2: Вывод чисел от 10 до 1
// Описание: Напишите цикл for, который выводит числа от 10 до 1 в обратном порядке.

// Solution:
// for (let j = 10; j > 0; j--) {
//   console.log(j);
// }


// Задача 3: Сумма чисел от 1 до 100
// Описание: Напишите цикл for, который вычисляет сумму всех чисел от 1 до 100.

// Solution:
// let result3 = 0
// for (let k = 1; k <= 100; k++) {
//   result3 += k
// }
// console.log(result3);


// Задача 4: Вывод четных чисел от 1 до 20
// Описание: Напишите цикл for, который выводит все четные числа от 1 до 20.

// Solution:
// for (let l = 1; l <= 20; l++) {
//   if (i % 2 === 0) {
//     console.log(l);
//   }
// }


// Задача 5: Вывод чисел, делящихся на 3
// Описание: Напишите цикл for, который выводит все числа от 1 до 30, которые делятся на 3.

// Solution:
for (let t = 1; t <= 30; t++) {
  if(t % 3 === 0){
    console.log(t)
  }
    
  
}

