// Задача 1: Сравнение чисел
// Описание: Объявите две переменные a и b и присвойте им значения 5 и 10 соответственно. Напишите код, который сравнивает эти две переменные и выводит результат сравнения в консоль.

// Solution:
let a = 5
let b = 10
let result1 = a < b
console.log(result1);


// Задача 2: Сравнение строк
// Описание: Объявите две переменные str1 и str2 и присвойте им значения "hello" и "world" соответственно. Напишите код, который сравнивает эти две строки и выводит результат сравнения в консоль.

// Solution:
let str1 = "hello"
let str2 = "world"
let result2 = str1 < str2
console.log(result2);


// Задача 3: Сравнение чисел с плавающей точкой
// Описание: Объявите две переменные x и y и присвойте им значения 0.1 + 0.2 и 0.3 соответственно. Напишите код, который сравнивает эти две переменные и выводит результат сравнения в консоль.

// Solution:
let x = 0.1 + 0.2
let y = 0.3
let result3 = x < y
console.log(result3);


// Задача 4: Сравнение с использованием оператора ===
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора === и выводит результат сравнения в консоль.

// Solution:
let num = 10
let str = "10"
let result4 = num === str
console.log(result4);


// Задача 5: Сравнение с использованием оператора !==
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора !== и выводит результат сравнения в консоль.

// Solution:
let num5 = 10
let str5 = "10"
let result5 = num5 !== str5
console.log(result5);


// Задача 6: Сравнение с использованием оператора <
// Описание: Объявите две переменные a и b и присвойте им значения 5 и 10 соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора < и выводит результат сравнения в консоль.

// Solution:
let a6 = 5
let b6 = 10
let result6 = a6 < b6
console.log(result6);


// Задача 7: Сравнение с использованием оператора >
// Описание: Объявите две переменные a и b и присвойте им значения 5 и 10 соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора > и выводит результат сравнения в консоль.

// Solution:
let a7 = 5
let b7 = 10
let result7 = a7 > b7
console.log(result7);


// Задача 8: Сравнение с использованием оператора <=
// Описание: Объявите две переменные a и b и присвойте им значения 5 и 10 соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора <= и выводит результат сравнения в консоль.

// Solution:
let a8 = 5
let b8 = 10
let result8 = a8 <= b8
console.log(result8);


// Задача 9: Сравнение с использованием оператора >=
// Описание: Объявите две переменные a и b и присвойте им значения 5 и 10 соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора >= и выводит результат сравнения в консоль.

// Solution:
let a9 = 5
let b9 = 10
let result9 = a9 >= b9
console.log(result9);


// Задача 10: Сравнение с использованием оператора ==
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора == и выводит результат сравнения в консоль.

// Solution:
let num10 = 10
let str10 = "10"
let result10 = num5 == str5
console.log(result10);


// Задача 11: Сравнение с использованием оператора !=
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора != и выводит результат сравнения в консоль.

// Solution:
let num11 = 10
let str11 = "10"
let result11 = num11 != str11
console.log(result11);


// Задача 12: Сравнение с использованием оператора > и <
// Описание: Объявите три переменные a, b и c и присвойте им значения 5, 10 и 7 соответственно. Напишите код, который проверяет, находится ли значение c между a и b (исключая границы) и выводит результат в консоль.

// Solution:
let a12 = 5
let b12 = 10
let c12 = 7
let result12 = a9 >= b9
console.log(result12);

// Задача 13: Сравнение с использованием оператора >= и <=
// Описание: Объявите три переменные a, b и c и присвойте им значения 5, 10 и 7 соответственно. Напишите код, который проверяет, находится ли значение c между a и b (включая границы) и выводит результат в консоль.

// Solution:
let a13 = 5
let b13 = 10
let c13 = 7
let result13 = a9 >= b9
console.log(result13);


// Задача 14: Сравнение с использованием оператора === и !==
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора === и !== и выводит результаты сравнения в консоль.

// Solution:
let num14 = 10
let str14 = "10"
let result141 = num14 === str14
let result142 = num14 !== str14
console.log(result141);
console.log(result142);


// Задача 15: Сравнение с использованием оператора == и !=
// Описание: Объявите две переменные num и str и присвойте им значения 10 и "10" соответственно. Напишите код, который сравнивает эти две переменные с использованием оператора == и != и выводит результаты сравнения в консоль.

// Solution:
let num15 = 10
let str15 = "10"
let result151 = num15 == str15
let result152 = num15 != str15
console.log(result151);
console.log(result152);